; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v9 ?v7)
             (pred_4 ?v11 ?v12)
             (pred_5 ?v9 ?v12)
             (pred_9 ?v6 ?v9 )
	     (pred_1 ?v9)
             (pred_6 ?v1)
             (pred_11 ?v11)
             (pred_7 ?v12)
             (pred_10 ?v9)
             (pred_3 ?v11)
             (pred_2 ?v9)
             (pred_8 ))



(:action op_3
:parameters (?v2 ?v5 ?v10 ?v8)
:precondition (and (pred_6 ?v2) (pred_6 ?v5) (pred_11 ?v10) (pred_7 ?v8)
          (pred_12 ?v2 ?v5) (pred_4 ?v10 ?v8)
                   (pred_5 ?v5 ?v8) (pred_1 ?v2) 
                   (pred_10 ?v5) (pred_3 ?v10))
:effect (and  (pred_2 ?v5) (not (pred_10 ?v5))))


(:action op_5
:parameters (?v2 ?v13)
:precondition (and (pred_6 ?v2) (pred_6 ?v13)
               (pred_1 ?v2) (pred_12 ?v2 ?v13) (pred_2 ?v13))
:effect (and (pred_1 ?v13) (not (pred_1 ?v2))))

(:action op_4
:parameters (?v2 ?v10)
:precondition (and (pred_6 ?v2) (pred_11 ?v10) 
                  (pred_1 ?v2) (pred_9 ?v10 ?v2) (pred_8 ))
:effect (and (pred_3 ?v10)
   (not (pred_9 ?v10 ?v2)) (not (pred_8 ))))


(:action op_2
:parameters (?v2 ?v4 ?v3)
:precondition (and (pred_6 ?v2) (pred_11 ?v4) (pred_11 ?v3)
                  (pred_1 ?v2) (pred_3 ?v3) (pred_9 ?v4 ?v2))
:effect (and (pred_3 ?v4) (pred_9 ?v3 ?v2)
        (not (pred_3 ?v3)) (not (pred_9 ?v4 ?v2))))

(:action op_1
:parameters (?v2 ?v10)
:precondition (and (pred_6 ?v2) (pred_11 ?v10) 
                  (pred_1 ?v2) (pred_3 ?v10))
:effect (and (pred_8 ) (pred_9 ?v10 ?v2) (not (pred_3 ?v10)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_01 obj_18 obj_17 obj_06 obj_15 obj_10 obj_12 obj_21 obj_14 obj_09 obj_04 obj_20 obj_19 obj_07 obj_13 obj_03
    obj_11 obj_02 obj_08
    obj_16 obj_22 obj_05
    )

    (:init
       (pred_8)

       (pred_6 obj_01)
       (pred_6 obj_18)
       (pred_6 obj_17)
       (pred_6 obj_06)
       (pred_6 obj_15)
       (pred_6 obj_10)
       (pred_6 obj_12)
       (pred_6 obj_21)
       (pred_6 obj_14)
       (pred_6 obj_09)
       (pred_6 obj_04)
       (pred_6 obj_20)
       (pred_6 obj_19)
       (pred_6 obj_07)
       (pred_6 obj_13)
       (pred_6 obj_03)
       (pred_7 obj_11)
       (pred_7 obj_02)
       (pred_7 obj_08)
       (pred_11 obj_16)
       (pred_11 obj_22)
       (pred_11 obj_05)

       (pred_12 obj_01 obj_15)
       (pred_12 obj_01 obj_18)
       (pred_12 obj_18 obj_10)
       (pred_12 obj_18 obj_17)
       (pred_12 obj_18 obj_01)
       (pred_12 obj_17 obj_12)
       (pred_12 obj_17 obj_06)
       (pred_12 obj_17 obj_18)
       (pred_12 obj_06 obj_21)
       (pred_12 obj_06 obj_17)
       (pred_12 obj_15 obj_14)
       (pred_12 obj_15 obj_10)
       (pred_12 obj_15 obj_01)
       (pred_12 obj_10 obj_09)
       (pred_12 obj_10 obj_12)
       (pred_12 obj_10 obj_18)
       (pred_12 obj_10 obj_15)
       (pred_12 obj_12 obj_04)
       (pred_12 obj_12 obj_21)
       (pred_12 obj_12 obj_17)
       (pred_12 obj_12 obj_10)
       (pred_12 obj_21 obj_20)
       (pred_12 obj_21 obj_06)
       (pred_12 obj_21 obj_12)
       (pred_12 obj_14 obj_19)
       (pred_12 obj_14 obj_09)
       (pred_12 obj_14 obj_15)
       (pred_12 obj_09 obj_07)
       (pred_12 obj_09 obj_04)
       (pred_12 obj_09 obj_10)
       (pred_12 obj_09 obj_14)
       (pred_12 obj_04 obj_13)
       (pred_12 obj_04 obj_20)
       (pred_12 obj_04 obj_12)
       (pred_12 obj_04 obj_09)
       (pred_12 obj_20 obj_03)
       (pred_12 obj_20 obj_21)
       (pred_12 obj_20 obj_04)
       (pred_12 obj_19 obj_07)
       (pred_12 obj_19 obj_14)
       (pred_12 obj_07 obj_13)
       (pred_12 obj_07 obj_09)
       (pred_12 obj_07 obj_19)
       (pred_12 obj_13 obj_03)
       (pred_12 obj_13 obj_04)
       (pred_12 obj_13 obj_07)
       (pred_12 obj_03 obj_20)
       (pred_12 obj_03 obj_13)
       (pred_10 obj_20)
       (pred_10 obj_04)
       (pred_10 obj_12)
       (pred_5  obj_20 obj_11)
       (pred_5  obj_04 obj_02)
       (pred_5  obj_12 obj_08)
       (pred_2 obj_01)
       (pred_2 obj_18)
       (pred_2 obj_17)
       (pred_2 obj_06)
       (pred_2 obj_15)
       (pred_2 obj_10)
       (pred_2 obj_21)
       (pred_2 obj_14)
       (pred_2 obj_09)
       (pred_2 obj_19)
       (pred_2 obj_07)
       (pred_2 obj_13)
       (pred_2 obj_03)

       (pred_4  obj_16 obj_11)
       (pred_4  obj_22 obj_02)
       (pred_4  obj_05 obj_08)
       (pred_9 obj_16 obj_06)
       (pred_9 obj_22 obj_19)
       (pred_9 obj_05 obj_04)
       (pred_1 obj_17)
    )

    (:goal (and
       (pred_9 obj_16 obj_09)
    ))
(:constraints
  (always (not (pred_1 obj_10)))
)
)

; plan
1. (op_5 obj_17 obj_06)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_06)
   goals met: 0 of 1
2. (op_4 obj_06 obj_16)
   deleted: (pred_9 obj_16 obj_06) (pred_8)
   added: (pred_3 obj_16)
   goals met: 0 of 1
3. (op_5 obj_06 obj_17)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_17)
   goals met: 0 of 1
4. (op_5 obj_17 obj_18)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_18)
   goals met: 0 of 1
5. (op_5 obj_18 obj_01)
   deleted: (pred_1 obj_18)
   added: (pred_1 obj_01)
   goals met: 0 of 1
6. (op_5 obj_01 obj_15)
   deleted: (pred_1 obj_01)
   added: (pred_1 obj_15)
   goals met: 0 of 1
7. (op_5 obj_15 obj_14)
   deleted: (pred_1 obj_15)
   added: (pred_1 obj_14)
   goals met: 0 of 1
8. (op_5 obj_14 obj_09)
   deleted: (pred_1 obj_14)
   added: (pred_1 obj_09)
   goals met: 0 of 1
9. (op_1 obj_09 obj_16)
   deleted: (pred_3 obj_16)
   added: (pred_8) (pred_9 obj_16 obj_09)
   goals met: 1 of 1
